cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/USBH_HS2_STM32H7xx.c
/* -----------------------------------------------------------------------------
 * Copyright (c) 2013-2023 Arm Limited (or its affiliates).
 * All rights reserved.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 *
 * $Date:        16. March 2023
 * $Revision:    V1.3
 *
 * Driver:       Driver_USBH2
 *
 * Configured:   via CubeMX
 * Project:      USB Full/Low-Speed Host Driver for ST STM32H7xx
 * -------------------------------------------------------------------------- */

/*! \page stm32h7_usbh1 USB Host 1

# Revision History

- Version 1.3
  - Corrected check if Host mode is enabled
- Version 1.2
  - Corrected port resume occasionally getting stuck in resume signaling
  - Added compile time configuration for reducing Bulk IN NAK rate
- Version 1.1
  - Enable VDD33USB voltage level detector if internal FS transceiver is used
- Version 1.0
  - Initial release

# Capabilities

This driver supports **Full** and **Low** speeds.

# Instances

Hardware resource relating to driver instance is shown in the table below:

Driver Instance | Hardware Resource
:---------------|:-----------------:
Driver_USBH1    | USB_OTG_FS


# Configuration

## Compile-time

Definitions used for compile-time configuration of this driver are shown in the table below:

Definition              | Default value | Max value | Description
:-----------------------|:-------------:|:---------:|:-----------
USBH1_MAX_PIPE_NUM      |    **16**     |      16   | Defines maximum number of Pipes that the driver will support. This value impacts driver memory requirements.
USBH1_BULK_IN_NAK_DELAY |     **0**     |   65535   | Delay between NAKs on the Bulk IN pipe (in SOFs), value 0 = not used (no delay between NAKs)

## STM32CubeMX

The USB Host driver requires:
  - **USB peripheral clock** at **48 MHz**
  - **USB_OTG_FS** peripheral configured as **Host_Only**

# STM32H743I-EVAL Board Configuration

These settings are relevant for this board, for different board please refer to the board
schematic for proper configuration.

Link to [STM32H743I-EVAL board schematic](https://www.st.com/resource/en/schematic_pack/mb1246-h743-e03_schematic.pdf).

## STM32CubeMX

Required peripherals for the **STM32H743I-EVAL** board are listed in the table below:

Peripheral  | Mode                         | Description
:----------:|:-----------------------------|:-----------
USB_OTG_FS  | Device_Only                  | USB Controller
PA9         | Input mode                   | USB VBUS Pin
PA11        | Alternate Function Push Pull | USB DM Pin
PA12        | Alternate Function Push Pull | USB DP Pin

\parblock
\note For the custom VBUS handling, please provide custom implementation of the **USBH1_VbusOnOff** function
\note For the custom over-current detection, please provide custom implementation of the **USBH1_GetOC** function
\endparblock

\note All settings have to be configured as described in the procedure below. Important settings,
      typically the ones different from default, are emphasized in **bold**.

### Pinout & Configuration tab

  1. In the **Pinout view** window click on a pin and select it's functionality:
        Pin      | Functionality
        :--------|:-------------:
        PA9      | **USB_OTG_FS_VBUS** (required for VBUS sensing)
        PA11     | **USB_OTG_FS_DM**
        PA12     | **USB_OTG_FS_DP**
       \n

  2. Under **Categories**: **Connectivity** select **USB_OTG_FS**:

     __Mode__:
       - Mode: **Host_Only**
       - Activate_VBUS: **VBUS sensing**
       - Activate_SOF: unchecked

     __Configuration__:
       - Parameter Settings: not used
       - User Constants: not used
       - NVIC Settings: configured in later step (under Category: System Core: NVIC)
       - GPIO Settings:
            Pin Name | Signal on Pin       | Pin Context..| GPIO output..| GPIO mode                     | GPIO Pull-up/Pull..| Maximum out..| Fast Mode | User Label
            :--------|:-------------------:|:------------:|:------------:|:-----------------------------:|:------------------:|:------------:|:---------:|:----------:
            PA9      | USB_OTG_FS_VBUS     | n/a          | n/a          | Input mode                    | No pull-up and no..| n/a          | n/a       | .
            PA11     | USB_OTG_FS_DM       | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
            PA12     | USB_OTG_FS_DP       | n/a          | n/a          | Alternate Function Push Pull  | No pull-up and no..| **High**     | n/a       | .
       \n

  3. Under **Categories**: **System Core** select **NVIC**:

     __Configuration__:
       - NVIC:
            NVIC Interrupt Table              | Enabled       | Preemption Priority | Sub Priority
            :---------------------------------|:-------------:|:-------------------:|:------------:
            USB On The Go FS global interrupt | **checked**   | 0                   | 0
       - Code generation:
            Enabled interrupt table           | Select for..  | Generate Enable in..| Generate IRQ h.. | Call HAL handler
            :---------------------------------|:-------------:|:-------------------:|:----------------:|:----------------:
            USB On The Go FS global interrupt | unchecked     | checked             | **unchecked**    | n/a

### Clock Configuration tab

  1. Configure **To USB (MHz)**: **48**

\note AHB frequency should be higher than 30 MHz

### Project Manager tab

  1. Under **Advanced Settings**:

     __Generated Function Calls__:
        Generate Code | Function Name               | Peripheral Inst..| Do not generate ..| Visibility (Static)
        :-------------|:---------------------------:|:----------------:|:-----------------:|:-------------------:
        checked       | MX_USB_OTG_FS_HCD_Init      | USB_OTG_FS       | **checked**       | checked

### Generate Code

