cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/USBH_HS2_STM32H7xx.c
Generate source code by clicking on the **GENERATE CODE** button on the toolbar.
*/

/*! \cond */

#include "USBH_HS2_STM32H7xx.h"

#include <string.h>

#include "stm32h7xx.h"
#include "stm32h7xx_hal.h"

#include "OTG_STM32H7xx.h"

#if    (OTG_FS_HOST_USED == 1)          // If OTG_FS is enabled and configured in Host mode in the CubeMX

#ifndef USBH1_MAX_PIPE_NUM
#define USBH_MAX_PIPE_NUM              (16U)
#else
#define USBH_MAX_PIPE_NUM              (USBH1_MAX_PIPE_NUM)
#endif
#if    (USBH_MAX_PIPE_NUM > 16U)
#error  Too many Pipes, maximum Pipes that this driver supports is 16 !!!
#endif

#ifndef USBH1_USE_DMA
#define USBH_USE_DMA                   (0U)
#else
#error USBH_HS2 Driver: DMA not supported!
#endif

#ifndef USBH1_DATA_CACHED
#define USBH_DATA_CACHED               (0U)
#else
#error USBH_HS2 Driver: Cache handling not supported!
#endif

// FIFO sizes in bytes (total available memory for FIFOs is 4 kB)
#define RX_FIFO_SIZE           (2048U)  // RxFIFO depth is half of max 4 kB
#define TX_FIFO_SIZE_NON_PERI  (1024U)  // Non-periodic Tx FIFO size
#define TX_FIFO_SIZE_PERI      (1024U)  // Periodic Tx FIFO size

#ifndef USBH1_BULK_IN_NAK_DELAY
#define USBH1_BULK_IN_NAK_DELAY   (0U)  // Delay (in SOFs) for new transfer after NAK on Bulk IN pipe
#endif

// Macro definitions for accessing peripheral registers
#define OTG                            (USB2_OTG_FS)
#define OTG_HOST                       ((USB_OTG_HostTypeDef *)       ((uint32_t)USB2_OTG_FS_PERIPH_BASE + USB_OTG_HOST_BASE))
#define OTG_HPRT                      *(__IO uint32_t *)              ((uint32_t)USB2_OTG_FS_PERIPH_BASE + USB_OTG_HOST_PORT_BASE)
#define OTG_PCGCCTL                   *(__IO uint32_t *)              ((uint32_t)USB2_OTG_FS_PERIPH_BASE + USB_OTG_PCGCCTL_BASE)
#define OTG_HC_PTR(ch)                 ((USB_OTG_HostChannelTypeDef *)((uint32_t)USB2_OTG_FS_PERIPH_BASE + USB_OTG_HOST_CHANNEL_BASE + ((ch) * USB_OTG_HOST_CHANNEL_SIZE)))
#define USB_IRQn                       (OTG_FS_IRQn)

#if (USBH_USE_DMA == 0U)                // If DMA is not used (Slave Mode)
static const uint32_t *OTG_DFIFO[] = { (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE                            ),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + ( 1U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + ( 2U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + ( 3U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + ( 4U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + ( 5U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + ( 6U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + ( 7U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + ( 8U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + ( 9U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + (10U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + (11U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + (12U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + (13U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + (14U * USB_OTG_FIFO_SIZE)),
                                       (uint32_t *)(USB2_OTG_FS_PERIPH_BASE + USB_OTG_FIFO_BASE + (15U * USB_OTG_FIFO_SIZE))
                                     };
#endif

// Definitions used to remove instances from source code
#define HHCD                            hhcd_USB_OTG_FS
#define HHCD_INSTANCE                   USB_OTG_FS
#define ROLE                            otg_fs_role


extern HCD_HandleTypeDef hhcd_USB_OTG_FS;


// Externally overridable callback functions allowing custom
// VBUS and over-current pin handling
extern void USBH1_VbusOnOff (bool vbus);
extern bool USBH1_GetOC     (void);

/**
  \fn          void USBH1_VbusOnOff (bool vbus)
  \brief       Drive VBUS on/off.
  \param[in]   vbus
                - \b false VBUS off
                - \b true  VBUS on
  \return      none
*/
__WEAK void USBH1_VbusOnOff (bool vbus) { (void)vbus; }

/**
  \fn          bool USBH1_GetOC (void)
  \brief       Get port over-current status.
  \return      port over-current status
                - \b false port is not in over-current status
                - \b true  port is in over-current status
*/
__WEAK bool USBH1_GetOC (void) { return false; }


// USBH Driver *****************************************************************

#define ARM_USBH_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1,3)

// Driver Version
static const ARM_DRIVER_VERSION usbh_driver_version = { ARM_USBH_API_VERSION, ARM_USBH_DRV_VERSION };

// Driver Capabilities
static const ARM_USBH_CAPABILITIES usbh_driver_capabilities = {
  0x0001U,      // Root HUB available Ports Mask
  0U,           // Automatic SPLIT packet handling
  1U,           // Signal Connect event
  1U,           // Signal Disconnect event
  0U            // Signal Overcurrent event
#if (defined(ARM_USBH_API_VERSION) && (ARM_USBH_API_VERSION >= 0x202U))
, 0U            // Reserved
#endif
};

typedef struct {                        // Pipe structure definition
           uint32_t  packet;
           uint8_t  *data;
           uint32_t  num;
  volatile uint32_t  num_transferred_total;
  volatile uint32_t  num_transferring;
           uint16_t  ep_max_packet_size;
           uint16_t  interval_reload;
  volatile uint16_t  interval;
           uint8_t   pad0;
           uint8_t   ep_dir;
           uint8_t   ep_type;
  volatile uint8_t   active;
  volatile uint8_t   in_progress;
  volatile uint8_t   event;
} PIPE_t;

static ARM_USBH_SignalPortEvent_t SignalPortEvent;
static ARM_USBH_SignalPipeEvent_t SignalPipeEvent;

static bool hw_initialized = false;
static bool hw_powered;
static bool port_reset;

// Pipes runtime information
static PIPE_t pipe[USBH_MAX_PIPE_NUM];


// Auxiliary functions

/**
  \fn          uint32_t USBH_CH_GetIndexFromAddress (USB_OTG_HostChannelTypeDef *ptr_ch)
  \brief       Get Index of Channel from it's Address.
  \param[in]   ptr_ch   Pointer to Channel
  \return      Index of the Channel
*/
__STATIC_INLINE uint32_t USBH_CH_GetIndexFromAddress (USB_OTG_HostChannelTypeDef *ptr_ch) {
  return (uint32_t)(ptr_ch - OTG_HC_PTR(0));
}

/**
  \fn          USB_OTG_HostChannelTypeDef *USBH_CH_GetAddressFromIndex (uint32_t index)
  \brief       Get Channel Address from it's Index.
  \param[in]   index    Index of Channel
  \return      Address of the Channel
*/
__STATIC_INLINE USB_OTG_HostChannelTypeDef *USBH_CH_GetAddressFromIndex (uint32_t index) {
  return (OTG_HC_PTR(0) + index);
}

/**
  \fn          USB_OTG_HostChannelTypeDef *USBH_CH_FindFree (void)
  \brief       Find a free Channel.
  \return      Pointer to first free Channel (NULL = no free Channel is available)
*/
__STATIC_INLINE USB_OTG_HostChannelTypeDef *USBH_CH_FindFree (void) {
  USB_OTG_HostChannelTypeDef *ptr_ch;
  uint32_t                    i;

  ptr_ch = OTG_HC_PTR(0);

  for (i = 0U; i < USBH_MAX_PIPE_NUM; i++) {
    if ((ptr_ch->HCCHAR & 0x3FFFFFFFU) == 0U) { return ptr_ch; }
    ptr_ch++;
  }

