cmjang/CtrBoard-H7_IMU_Altitude/AC6_Code/MDK-ARM/.pack/Keil/STM32H7xx_DFP.3.1.1/CMSIS/Driver/USBH_HS2_STM32H7xx.c
  return NULL;
}

/**
  \fn          bool USBH_CH_Disable (USB_OTG_HostChannelTypeDef *ptr_ch)
  \brief       Disable Channel.
  \param[in]   ptr_ch   Pointer to Channel
  \return      true = success, false = fail
*/
__STATIC_INLINE bool USBH_CH_Disable (USB_OTG_HostChannelTypeDef *ptr_ch) {
  uint32_t i;

  if (ptr_ch == 0U) { return false; }

  ptr_ch->HCTSIZ &= ~USB_OTG_HCTSIZ_DOPING;

  if ((ptr_ch->HCINT & USB_OTG_HCINT_CHH) != 0U) { return true; }

  if ((ptr_ch->HCCHAR & USB_OTG_HCCHAR_CHENA) != 0U) {
    ptr_ch->HCINTMSK = 0U;
    HAL_Delay(1U);
    if ((ptr_ch->HCINT & USB_OTG_HCINT_NAK) != 0U) {
      ptr_ch->HCINT  =  0x7FFU;
      return true;
    }
    ptr_ch->HCINT  =  0x7FFU;
    ptr_ch->HCCHAR =  ptr_ch->HCCHAR | USB_OTG_HCCHAR_CHENA | USB_OTG_HCCHAR_CHDIS;
    for (i = 0U; i < 1000U; i++) {
      if ((ptr_ch->HCINT & USB_OTG_HCINT_CHH) != 0U) {
        ptr_ch->HCINT = 0x7FFU;
        return true;
      }
    }
    return false;
  }

  return true;
}

/**
  \fn          bool USBH_HW_StartTransfer (PIPE_t *ptr_pipe, USB_OTG_HostChannelTypeDef *ptr_ch)
  \brief       Start transfer on Pipe.
  \param[in]   ptr_pipe Pointer to Pipe
  \param[in]   ptr_ch   Pointer to Channel
  \return      true = success, false = fail
*/
static bool USBH_HW_StartTransfer (PIPE_t *ptr_pipe, USB_OTG_HostChannelTypeDef *ptr_ch) {
  uint32_t  hcchar;
  uint32_t  hctsiz;
  uint32_t  hcintmsk;
  uint32_t  num_to_transfer;
#if (USBH_USE_DMA == 0U)                        // If DMA is not used (Slave Mode)
  uint32_t  txsts;
  uint32_t  pckt_num;
  uint32_t  data_num;
  uint32_t  max_pckt_size;
  uint32_t  max_data;
  uint32_t  max_num_pckt;
  uint8_t  *ptr_src;
  uint32_t *ptr_dest;
  uint16_t  cnt;
  uint8_t   out;
#else                                           // If DMA is used
#if ((USBH_DATA_CACHED == 1U) && (__DCACHE_PRESENT == 1U))
  uint8_t   out;
#endif
#endif

  if (ptr_pipe == 0U)                        { return false; }
  if (ptr_ch   == 0U)                        { return false; }
  if ((OTG_HPRT & USB_OTG_HPRT_PCSTS) == 0U) { return false; }

  hcchar   = ptr_ch->HCCHAR;                    // Read channel characteristics
  hctsiz   = ptr_ch->HCTSIZ;                    // Read channel size info
  hcintmsk = 0U;
#if (USBH_USE_DMA == 0U)                        // If DMA is not used (Slave Mode)
  cnt      = 0U;
  out      = 0U;
#else                                           // If DMA is used
#if ((USBH_DATA_CACHED == 1U) && (__DCACHE_PRESENT == 1U))
  out      = 0U;
#endif
#endif

  // Prepare transfer
                                                // Prepare HCCHAR register
  hcchar       &= (USB_OTG_HCCHAR_ODDFRM    |   // Keep ODDFRM
                   USB_OTG_HCCHAR_DAD       |   // Keep DAD
                   USB_OTG_HCCHAR_MC        |   // Keep MCNT
                   USB_OTG_HCCHAR_EPTYP     |   // Keep EPTYP
                   USB_OTG_HCCHAR_LSDEV     |   // Keep LSDEV
                   USB_OTG_HCCHAR_EPNUM     |   // Keep EPNUM
                   USB_OTG_HCCHAR_MPSIZ)    ;   // Keep MPSIZ
  hctsiz       &=  USB_OTG_HCTSIZ_DPID;         // Keep DPID
#if (USBH_USE_DMA != 0U)                        // If DMA is used
  switch (ptr_pipe->packet & ARM_USBH_PACKET_TOKEN_Msk) {
    case ARM_USBH_PACKET_IN:
      hcchar   |=  USB_OTG_HCCHAR_EPDIR;
      hcintmsk  = (USB_OTG_HCINTMSK_DTERRM  |
                   USB_OTG_HCINTMSK_BBERRM  |
                   USB_OTG_HCINTMSK_TXERRM  |
                   USB_OTG_HCINTMSK_STALLM  |
                   USB_OTG_HCINTMSK_XFRCM)  ;
      break;
    case ARM_USBH_PACKET_OUT:
      hcchar   &= ~USB_OTG_HCCHAR_EPDIR;
      hcintmsk  = (USB_OTG_HCINTMSK_TXERRM  |
                   USB_OTG_HCINTMSK_STALLM  |
                   USB_OTG_HCINTMSK_XFRCM)  ;
#if ((USBH_DATA_CACHED == 1U) && (__DCACHE_PRESENT == 1U))
      out       =  1U;
#endif
      break;
    case ARM_USBH_PACKET_SETUP:
      hcchar   &= ~USB_OTG_HCCHAR_EPDIR;
      hcintmsk  = (USB_OTG_HCINTMSK_TXERRM  |
                   USB_OTG_HCINTMSK_XFRCM)  ;
      hctsiz   |=  USB_OTG_HCTSIZ_DPID;
#if ((USBH_DATA_CACHED == 1U) && (__DCACHE_PRESENT == 1U))
      out       =  1U;
#endif
      break;
    default:
      return false;
  }
  if (ptr_pipe->ep_type == ARM_USB_ENDPOINT_INTERRUPT) {
    hcintmsk   |=  USB_OTG_HCINTMSK_NAKM    ;   // Enable NAK for interrupt endpoint as DMA does not handle periodic transmissions
  }

  num_to_transfer = ptr_pipe->num - ptr_pipe->num_transferred_total;
  if (num_to_transfer > (1023U*512U)) {
    // Limit number of bytes to transfer to maximum that can fit into XFRSIZ field of HCTSIZ register
    num_to_transfer = 1023U*512U;
  }
  if (ptr_pipe->ep_type == ARM_USB_ENDPOINT_INTERRUPT) {
    if ((OTG_HOST->HFNUM & 1U) != 0U) {
      hcchar &= ~USB_OTG_HCCHAR_ODDFRM;
    } else {
      hcchar |=  USB_OTG_HCCHAR_ODDFRM;
    }
  }
#else                                           // If DMA is not used (Slave Mode)
  if ((ptr_pipe->packet & ARM_USBH_PACKET_PING) != 0U) {
    hcchar     &= ~USB_OTG_HCCHAR_EPDIR;
    hcintmsk    =  USB_OTG_HCINTMSK_TXERRM |
                   USB_OTG_HCINTMSK_ACKM   |
                   USB_OTG_HCINTMSK_NAKM   |
                   USB_OTG_HCINTMSK_STALLM |
                   USB_OTG_HCINTMSK_XFRCM  ;
    hctsiz     |=  USB_OTG_HCTSIZ_DOPING;       // Do PING
    out         =  1U;
    num_to_transfer = 0U;
  } else {
    switch (ptr_pipe->packet & ARM_USBH_PACKET_TOKEN_Msk) {
      case ARM_USBH_PACKET_IN:
        hcchar   |=  USB_OTG_HCCHAR_EPDIR;
        hcintmsk  = (USB_OTG_HCINTMSK_DTERRM  |
                     USB_OTG_HCINTMSK_BBERRM  |
                     USB_OTG_HCINTMSK_TXERRM  |
                     USB_OTG_HCINTMSK_ACKM    |
                     USB_OTG_HCINTMSK_NAKM    |
                     USB_OTG_HCINTMSK_STALLM  |
                     USB_OTG_HCINTMSK_XFRCM)  ;
        break;
      case ARM_USBH_PACKET_OUT:
        hcchar   &= ~USB_OTG_HCCHAR_EPDIR;
        hcintmsk  = (USB_OTG_HCINTMSK_TXERRM  |
                     USB_OTG_HCINTMSK_NYET    |
//                   USB_OTG_HCINTMSK_ACKM    | // After ACK there must be other relevant interrupt so ACK is ignored
                     USB_OTG_HCINTMSK_NAKM    |
                     USB_OTG_HCINTMSK_STALLM  |
                     USB_OTG_HCINTMSK_XFRCM)  ;
        out       =  1U;
        break;
      case ARM_USBH_PACKET_SETUP:
        hcchar   &= ~USB_OTG_HCCHAR_EPDIR;
        hcintmsk  = (USB_OTG_HCINTMSK_TXERRM  |
                     USB_OTG_HCINTMSK_XFRCM)  ;
        hctsiz   |=  USB_OTG_HCTSIZ_DPID;
        out       =  1U;
        break;
      default:
        return false;
    }

    num_to_transfer = ptr_pipe->num - ptr_pipe->num_transferred_total;
    if (out != 0U) {
      txsts = OTG->HNPTXSTS;                    // Read non-periodic FIFO status
    } else {
      txsts = 0U;
    }
    switch (ptr_pipe->ep_type) {
      case ARM_USB_ENDPOINT_CONTROL:
      case ARM_USB_ENDPOINT_BULK:
        break;
      case ARM_USB_ENDPOINT_ISOCHRONOUS:
      case ARM_USB_ENDPOINT_INTERRUPT:
        if ((OTG_HOST->HFNUM & 1U) != 0U) {
          hcchar &= ~USB_OTG_HCCHAR_ODDFRM;
        } else {
          hcchar |=  USB_OTG_HCCHAR_ODDFRM;
        }
        break;
    }
    if (out != 0U) {
      // For packet OUT/SETUP limit number of bytes to send to maximum FIFO size
      // and maximum number of packets
      max_pckt_size =  ptr_pipe->ep_max_packet_size;
      max_data      = (txsts & 0x0000FFFFU) <<  2;
      max_num_pckt  = (txsts & 0x00FF0000U) >> 16;
      if (num_to_transfer > max_data) {
        num_to_transfer = max_data;
      }
      data_num = num_to_transfer;
      for (pckt_num = 1; data_num > max_pckt_size; pckt_num++) {
        data_num -= max_pckt_size;
      }
      if (pckt_num > max_num_pckt) {
        pckt_num = max_num_pckt;
      }

      if (num_to_transfer > (pckt_num * max_pckt_size)) {
        num_to_transfer = pckt_num * max_pckt_size;
      }
      cnt = (uint16_t)((num_to_transfer + 3U) / 4U);
    }
  }
#endif

  hcchar &= ~USB_OTG_HCCHAR_CHDIS;
  hcchar |=  USB_OTG_HCCHAR_CHENA;

                                                // Prepare HCTSIZ register
  switch (ptr_pipe->packet & ARM_USBH_PACKET_DATA_Msk) {
    case ARM_USBH_PACKET_DATA0:
      hctsiz   &= ~USB_OTG_HCTSIZ_DPID;
      hctsiz   |=  USB_OTG_HCTSIZ_DPID_0;
      break;
    case ARM_USBH_PACKET_DATA1:
      hctsiz   &= ~USB_OTG_HCTSIZ_DPID;
      hctsiz   |=  USB_OTG_HCTSIZ_DPID_1;
      break;
    default:
      break;
  }

                                                // Prepare HCTSIZ register
  if (num_to_transfer != 0U) {                  // Normal packet
                                                // Prepare PKTCNT field
    hctsiz |= ((num_to_transfer + ptr_pipe->ep_max_packet_size - 1U) / ptr_pipe->ep_max_packet_size) << 19;
    hctsiz |=   num_to_transfer;                // Prepare XFRSIZ field
  } else {                                      // Zero length packet
    hctsiz |=   1U << 19;                       // Prepare PKTCNT field
    hctsiz |=   0U;                             // Prepare XFRSIZ field
  }

#if (USBH_USE_DMA != 0U)                        // If DMA is used
  ptr_pipe->num_transferring = num_to_transfer;
#if ((USBH_DATA_CACHED == 1U) && (__DCACHE_PRESENT == 1U))
  if ((SCB->CCR & SCB_CCR_DC_Msk) != 0U) {      // If Data Cache is enabled
    if ((out != 0U) && (num_to_transfer > 0U)) {
      SCB_CleanDCache_by_Addr ((uint32_t *)((uint32_t)(ptr_pipe->data + ptr_pipe->num_transferred_total) & (~0x1FU)), (int32_t)num_to_transfer + 31);
    }
  }
#endif
  ptr_ch->HCDMA    = (uint32_t)(ptr_pipe->data + ptr_pipe->num_transferred_total);
  ptr_ch->HCINTMSK = hcintmsk;                  // Enable channel interrupts
  ptr_ch->HCTSIZ   = hctsiz;                    // Write ch transfer size
  ptr_ch->HCCHAR   = hcchar;                    // Write ch characteristics
#else                                           // If DMA is not used (Slave Mode)
  if (cnt != 0U) {
    ptr_src  = ptr_pipe->data + ptr_pipe->num_transferred_total;
    ptr_dest = (uint32_t *)((uint32_t)OTG_DFIFO[USBH_CH_GetIndexFromAddress (ptr_ch)]);
  } else {
    ptr_src  = NULL;
    ptr_dest = NULL;
  }

  if (out != 0U) {
    // For OUT/SETUP transfer num_transferring represents num of bytes to be sent
    ptr_pipe->num_transferring = num_to_transfer;
  } else {
    // For IN transfer num_transferring represents num of bytes received (handled in IRQ)
    ptr_pipe->num_transferring = 0U;
  }
  NVIC_DisableIRQ (USB_IRQn);                   // Disable OTG interrupt
  ptr_ch->HCINTMSK = hcintmsk;                  // Enable channel interrupts
  ptr_ch->HCTSIZ   = hctsiz;                    // Write ch transfer size
  ptr_ch->HCCHAR   = hcchar;                    // Write ch characteristics
  while (cnt != 0U) {                           // Load data
    *ptr_dest = __UNALIGNED_UINT32_READ(ptr_src);
    ptr_src  += 4U;
    cnt--;
  }
  NVIC_EnableIRQ  (USB_IRQn);                   // Enable OTG interrupt
#endif

